apache/nuttx/arch/risc-v/src/esp32c2/esp_ble_adapter.c
static DRAM_ATTR uint32_t g_btdm_lpcycle_us = 0;

/* number of fractional bit for g_btdm_lpcycle_us */

static DRAM_ATTR uint8_t g_btdm_lpcycle_us_frac = 0;

/* low power status struct */

static DRAM_ATTR btdm_lpstat_t g_lp_stat;

/* low power control struct */

static DRAM_ATTR btdm_lpcntl_t g_lp_cntl;

/* semaphore used for blocking VHCI API to wait for controller to wake up */

static DRAM_ATTR void * g_wakeup_req_sem = NULL;

/* wakeup timer */

static DRAM_ATTR esp_timer_handle_t g_btdm_slp_tmr = NULL;

#ifdef CONFIG_PM
static DRAM_ATTR esp_pm_lock_handle_t g_pm_lock;

/* pm_lock to prevent light sleep due to incompatibility currently */

static DRAM_ATTR esp_pm_lock_handle_t g_light_sleep_pm_lock;
#endif

/* BT interrupt private data */

irqstate_t g_ble_int_flags;

static int g_ble_int_count = 0;

/* Cached queue control variables */

#ifdef CONFIG_ESPRESSIF_SPIFLASH
static struct esp_queuecache_s g_esp_queuecache;
static uint8_t g_esp_queuecache_buffer[BLE_TASK_EVENT_QUEUE_ITEM_SIZE];
#endif

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Inline Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp_errno_trans
 *
 * Description:
 *   Transform from nuttx error code to Wi-Fi adapter error code
 *
 * Input Parameters:
 *   ret - NuttX error code
 *
 * Returned Value:
 *   Wi-Fi adapter error code
 *
 ****************************************************************************/

static inline int32_t esp_errno_trans(int ret)
{
  return ret == 0;
}

/****************************************************************************
 * Functions to be registered to struct osi_funcs_s
 ****************************************************************************/

/****************************************************************************
 * Name: esp_bt_power_domain_on
 *
 * Description:
 *   Power up the BT domain
 *
 * Input Parameters:
 *   none
 *
 * Returned Value:
 *   none
 *
 ****************************************************************************/

static IRAM_ATTR void esp_bt_power_domain_on(void)
{
#if SOC_PM_SUPPORT_BT_PD
  modifyreg32(RTC_CNTL_DIG_PWC_REG, RTC_CNTL_BT_FORCE_PD, 0);
  modifyreg32(RTC_CNTL_DIG_ISO_REG, RTC_CNTL_BT_FORCE_ISO, 0);
#endif
  esp_wifi_bt_power_domain_on();
}

/****************************************************************************
 * Name: esp_bt_power_domain_off
 *
 * Description:
 *   Power down the BT domain
 *
 * Input Parameters:
 *   none
 *
 * Returned Value:
 *   none
 *
 ****************************************************************************/

static IRAM_ATTR void esp_bt_power_domain_off(void)
{
#if SOC_PM_SUPPORT_BT_PD
  modifyreg32(RTC_CNTL_DIG_ISO_REG, 0, RTC_CNTL_BT_FORCE_ISO);
  modifyreg32(RTC_CNTL_DIG_PWC_REG, 0, RTC_CNTL_BT_FORCE_PD);
#endif
  esp_wifi_bt_power_domain_off();
}

/****************************************************************************
 * Name: interrupt_alloc_wrapper
 *
 * Description:
 *   This function allocates an interrupt. It first allocates memory for the
 *   interrupt and its handle. If this fails, it returns an error. Then, it
 *   sets up the interrupt and gets its IRQ. If this fails, it returns an
 *   error. Finally, it attaches the interrupt to the IRQ. If this fails, it
 *   returns an error.
 *
 * Input Parameters:
 *   cpu_id - The ID of the CPU where the interrupt will be allocated.
 *   source - The source of the interrupt.
 *   handler - The handler function for the interrupt.
 *   arg - The argument for the handler function.
 *   ret_handle - A pointer to the handle of the interrupt.
 *
 * Returned Value:
 *   ESP_OK on success, or ESP_ERR_INVALID_ARG on failure.
 *
 ****************************************************************************/

static int interrupt_alloc_wrapper(int cpu_id,
                                   int source,
                                   intr_handler_t handler,
                                   void *arg,
                                   void **ret_handle)
{
  struct intr_adapter_to_nuttx *isr_adapter_args;
  int ret = OK;
  int cpuint;
  int irq;

  wlinfo("cpu_id=%d , source=%d , handler=%p, arg=%p, ret_handle=%p\n",
         cpu_id, source, handler, arg, ret_handle);

  isr_adapter_args = kmm_calloc(1, sizeof(struct intr_adapter_to_nuttx));
  if (isr_adapter_args == NULL)
    {
      irqerr("Failed to kmm_calloc\n");
      return ESP_ERR_NO_MEM;
    }

  isr_adapter_args->handler = handler;
  isr_adapter_args->arg = arg;

  cpuint = esp_setup_irq(source, 2, ESP_IRQ_TRIGGER_LEVEL, esp_int_adpt_cb,
                         isr_adapter_args);
  if (cpuint < 0)
    {
      return ESP_ERR_NOT_FOUND;
    }

  (*ret_handle) = (void *)esp_get_handle(cpu_id, ESP_SOURCE2IRQ(source));

  return ESP_OK;
}

/****************************************************************************
 * Name: interrupt_free_wrapper
 *
 * Description:
 *   Not supported. Clear previously bound interrupt IRQ.
 *
 * Input Parameters:
 *   handle - A pointer to the interrupt handle.
 *
 * Returned Value:
 *   NuttX error code
 *
 ****************************************************************************/

static int interrupt_free_wrapper(void *handle)
{
  DEBUGPANIC();

  return ESP_FAIL;
}

/****************************************************************************
 * Name: global_interrupt_disable
 *
 * Description:
 *   Enter critical section by disabling interrupts and taking the spin lock
 *   if in SMP mode.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void IRAM_ATTR global_interrupt_disable(void)
{
  struct irqstate_list_s *irqstate;

