apache/nuttx/arch/risc-v/src/esp32c2/esp_ble_adapter.c
  return esp_errno_trans(ret);
}

/****************************************************************************
 * Name: esp_update_time
 *
 * Description:
 *   Transform ticks to time and add this time to timespec value
 *
 * Input Parameters:
 *   ticks - System ticks
 *
 * Output Parameters:
 *   timespec - Input timespec data pointer
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp_update_time(struct timespec *timespec, uint32_t ticks)
{
  uint32_t tmp;

  tmp = TICK2SEC(ticks);
  timespec->tv_sec += tmp;

  ticks -= SEC2TICK(tmp);
  tmp = TICK2NSEC(ticks);

  timespec->tv_nsec += tmp;
}

/****************************************************************************
 * Name: btdm_slp_tmr_callback
 *
 * Description:
 *   ESP-C3 BLE sleep callback function.
 *
 * Input Parameters:
 *   arg - Unused
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR btdm_slp_tmr_callback(void *arg)
{
#ifdef CONFIG_PM
  r_btdm_vnd_offload_post(BTDM_VND_OL_SIG_WAKEUP_TMR,
                          (void *)BTDM_ASYNC_WAKEUP_SRC_TMR);
#endif
}

/****************************************************************************
 * Name: esp_int_adpt_cb
 *
 * Description:
 *   BT interrupt adapter callback function
 *
 * Input Parameters:
 *   irq     - IRQ associated to that interrupt.
 *   context - Interrupt register state save info.
 *   arg     - A pointer to the argument provided when the interrupt
 *             was registered.
 *
 * Returned Value:
 *   NuttX error code
 *
 ****************************************************************************/

static int IRAM_ATTR esp_int_adpt_cb(int irq, void *context, void *arg)
{
  struct intr_adapter_to_nuttx *isr_adapter_args;

  isr_adapter_args = (struct intr_adapter_to_nuttx *)arg;

  isr_adapter_args->handler(isr_adapter_args->arg);

  return OK;
}

/****************************************************************************
 * Name: btdm_sleep_exit_phase0
 *
 * Description:
 *   Acquire PM lock and stop esp timer.
 *
 * Input Parameters:
 *   param - wakeup event
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR btdm_sleep_exit_phase0(void *param)
{
  DEBUGASSERT(g_lp_cntl.enable);

#ifdef CONFIG_PM
  if (g_lp_stat.pm_lock_released)
    {
      esp_pm_lock_acquire(g_pm_lock);
      g_lp_stat.pm_lock_released = 0;
    }
#endif

  int event = (int)param;

  if (event == BTDM_ASYNC_WAKEUP_SRC_VHCI ||
      event == BTDM_ASYNC_WAKEUP_SRC_DISA)
    {
      btdm_wakeup_request();
    }

  if (g_lp_cntl.wakeup_timer_required && g_lp_stat.wakeup_timer_started)
    {
      esp_timer_stop(g_btdm_slp_tmr);
      g_lp_stat.wakeup_timer_started = 0;
    }

  if (event == BTDM_ASYNC_WAKEUP_SRC_VHCI ||
      event == BTDM_ASYNC_WAKEUP_SRC_DISA)
    {
      semphr_give_wrapper(g_wakeup_req_sem);
    }
}

#if CONFIG_MAC_BB_PD

/****************************************************************************
 * Name: btdm_mac_bb_power_down_cb
 *
 * Description:
 *   This function is a callback that powers down the MAC and baseband (BB)
 *   of the Bluetooth module. It first checks if the power down control for
 *   the MAC and BB is enabled and if they are not already powered down. If
 *   these conditions are met, it powers down the DMA and sets the MAC and BB
 *   as powered down.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR btdm_mac_bb_power_down_cb(void)
{
  if (g_lp_cntl.mac_bb_pd && g_lp_stat.mac_bb_pd == 0)
    {
      btdm_ble_power_down_dma_copy(true);
      g_lp_stat.mac_bb_pd = 1;
    }
}

/****************************************************************************
 * Name: btdm_mac_bb_power_up_cb
 *
 * Description:
 *   This function is a callback that powers up the MAC and baseband (BB)
 *   of the Bluetooth module. It first checks if the power down control for
 *   the MAC and BB is enabled and if they are currently powered down. If
 *   these conditions are met, it powers up the DMA and sets the MAC and BB
 *   as powered up.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR btdm_mac_bb_power_up_cb(void)
{
  if (g_lp_cntl.mac_bb_pd && g_lp_stat.mac_bb_pd)
    {
      btdm_ble_power_down_dma_copy(false);
      g_lp_stat.mac_bb_pd = 0;
    }
}
#endif

static esp_err_t btdm_low_power_mode_init(esp_bt_controller_config_t *cfg)
{
  esp_err_t err = ESP_OK;
  bool select_src_ret;
  bool set_div_ret;

  do
    {
      /* set default values for global states or resources */

      g_lp_stat.val = 0;
      g_lp_cntl.val = 0;
      g_lp_cntl.main_xtal_pu = 0;
      g_wakeup_req_sem = NULL;
      g_btdm_slp_tmr = NULL;
      g_lp_cntl.wakeup_timer_required = 0;

      /* configure and initialize resources */

      g_lp_cntl.enable = (cfg->sleep_mode == ESP_BT_SLEEP_MODE_1) ? 1 : 0;
      g_lp_cntl.lpclk_sel = (cfg->sleep_mode == ESP_BT_SLEEP_MODE_1) ? \
                            cfg->sleep_clock : ESP_BT_SLEEP_CLOCK_MAIN_XTAL;
      g_lp_cntl.no_light_sleep = 0;

      if (g_lp_cntl.enable)
        {
#if CONFIG_MAC_BB_PD
          if (!btdm_deep_sleep_mem_init())
            {
              err = ESP_ERR_NO_MEM;
              break;
            }

          g_lp_cntl.mac_bb_pd = 1;
#endif
#ifdef CONFIG_PM
          g_lp_cntl.wakeup_timer_required = 1;
#endif
          /* async wakeup semaphore for VHCI */

          g_wakeup_req_sem = semphr_create_wrapper(1, 0);
          if (g_wakeup_req_sem == NULL)
            {
              err = ESP_ERR_NO_MEM;
              break;
            }

          btdm_vnd_offload_task_register(BTDM_VND_OL_SIG_WAKEUP_TMR,
                                         btdm_sleep_exit_phase0);

          if (g_lp_cntl.wakeup_timer_required)
            {
              esp_timer_create_args_t create_args =
                {
                  .callback = btdm_slp_tmr_callback,
                  .arg = NULL,
                  .name = "btSlp",
                };

              esp_timer_create(&create_args, &g_btdm_slp_tmr);
            }

