apache/nuttx/arch/risc-v/src/esp32c2/esp_ble_adapter.c
#ifdef CONFIG_PM
  if (g_lp_cntl.no_light_sleep)
    {
      if (g_light_sleep_pm_lock != NULL)
        {
          esp_pm_lock_delete(g_light_sleep_pm_lock);
          g_light_sleep_pm_lock = NULL;
        }
    }

  if (g_pm_lock != NULL)
    {
      esp_pm_lock_delete(g_pm_lock);
      g_pm_lock = NULL;
      g_lp_stat.pm_lock_released = 0;
    }
#endif

  if (g_lp_cntl.wakeup_timer_required && g_btdm_slp_tmr != NULL)
    {
      if (g_lp_stat.wakeup_timer_started)
        {
          esp_timer_stop(g_btdm_slp_tmr);
        }

      g_lp_stat.wakeup_timer_started = 0;
      esp_timer_delete(g_btdm_slp_tmr);
      g_btdm_slp_tmr = NULL;
    }

  if (g_lp_cntl.enable)
    {
      btdm_vnd_offload_task_deregister(BTDM_VND_OL_SIG_WAKEUP_TMR);
      if (g_wakeup_req_sem != NULL)
        {
          semphr_delete_wrapper(g_wakeup_req_sem);
          g_wakeup_req_sem = NULL;
        }
    }

  if (g_lp_cntl.lpclk_sel == ESP_BT_SLEEP_CLOCK_MAIN_XTAL)
    {
#ifdef CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP
      if (g_lp_cntl.main_xtal_pu)
        {
          esp_sleep_pd_config(ESP_PD_DOMAIN_XTAL, ESP_PD_OPTION_OFF);
          g_lp_cntl.main_xtal_pu = 0;
        }
#endif

      btdm_lpclk_select_src(BTDM_LPCLK_SEL_RTC_SLOW);
      btdm_lpclk_set_div(0);
#if CONFIG_ESPRESSIF_WIFI_BT_COEXIST
      coex_update_lpclk_interval();
#endif
    }

  g_btdm_lpcycle_us = 0;
}

/****************************************************************************
 * Name: async_wakeup_request
 *
 * Description:
 *   Request the BLE Controller to wakeup
 *
 * Input Parameters:
 *   event - the event that triggered the wakeup
 *
 * Returned Value:
 *   true if request lock is needed, false otherwise
 *
 ****************************************************************************/

static bool async_wakeup_request(int event)
{
  bool do_wakeup_request = false;

  if (g_lp_cntl.enable == 0)
    {
      return false;
    }

  switch (event)
    {
      case BTDM_ASYNC_WAKEUP_SRC_VHCI:
      case BTDM_ASYNC_WAKEUP_SRC_DISA:
        btdm_in_wakeup_requesting_set(true);

        if (btdm_power_state_active() == false)
          {
            r_btdm_vnd_offload_post(BTDM_VND_OL_SIG_WAKEUP_TMR,
                                    (void *)event);
            do_wakeup_request = true;
            semphr_take_wrapper(g_wakeup_req_sem, OSI_FUNCS_TIME_BLOCKING);
          }
        break;
      case BTDM_ASYNC_WAKEUP_REQ_COEX:
        if (!btdm_power_state_active())
          {
            do_wakeup_request = true;
#ifdef CONFIG_PM
            if (g_lp_stat.pm_lock_released)
              {
                esp_pm_lock_acquire(g_pm_lock);
                g_lp_stat.pm_lock_released = 0;
              }
#endif

            btdm_wakeup_request();

            if (g_lp_cntl.wakeup_timer_required &&
                g_lp_stat.wakeup_timer_started)
              {
                esp_timer_stop(g_btdm_slp_tmr);
                g_lp_stat.wakeup_timer_started = 0;
              }
          }

      default:
        return false;
    }

  return do_wakeup_request;
}

/****************************************************************************
 * Name: async_wakeup_request_end
 *
 * Description:
 *   Finish a wakeup request
 *
 * Input Parameters:
 *   event - the event that triggered the wakeup
 *
 * Returned Value:
 *   true if request lock is needed, false otherwise
 *
 ****************************************************************************/

static void async_wakeup_request_end(int event)
{
  bool allow_to_sleep;

  if (g_lp_cntl.enable == 0)
    {
      return;
    }

  switch (event)
    {
      case BTDM_ASYNC_WAKEUP_SRC_VHCI:
      case BTDM_ASYNC_WAKEUP_SRC_DISA:
        allow_to_sleep = true;
        break;
      case BTDM_ASYNC_WAKEUP_REQ_COEX:
        allow_to_sleep = false;
        break;
      default:
        allow_to_sleep = true;
        break;
    }

  if (allow_to_sleep)
    {
      btdm_in_wakeup_requesting_set(false);
    }
}

/****************************************************************************
 * Name: btdm_funcs_table_ready_wrapper
 *
 * Description:
 *   This is a wrapper for preparing the BTDM functions table. If the BT_BLE
 *   CCA mode is set to 2, it enables the CCA feature by calling the
 *   btdm_cca_feature_enable function.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void btdm_funcs_table_ready_wrapper(void)
{
#if BT_BLE_CCA_MODE == 2
  btdm_cca_feature_enable();
#endif
#if BLE_CTRL_CHECK_CONNECT_IND_ACCESS_ADDRESS_ENABLED
  btdm_aa_check_enhance_enable();
#endif
#if CONFIG_BT_CTRL_RUN_IN_FLASH_ONLY
  /* Do nothing */
#else
  wlinfo("Feature Config, ADV:%d, BLE_50:%d, DTM:%d, SCAN:%d, CCA:%d, "
          "SMP:%d, CONNECT:%d", BT_CTRL_BLE_ADV, BT_CTRL_50_FEATURE_SUPPORT,
          BT_CTRL_DTM_ENABLE, BT_CTRL_BLE_SCAN, BT_BLE_CCA_MODE,
          BLE_SECURITY_ENABLE, BT_CTRL_BLE_MASTER);

  ble_base_funcs_reset();

#  if CONFIG_BT_CTRL_BLE_ADV
  ble_42_adv_funcs_reset();
#    if (BT_CTRL_50_FEATURE_SUPPORT == 1)
  ble_ext_adv_funcs_reset();
#    endif
#  endif

#  if CONFIG_BT_CTRL_DTM_ENABLE
  ble_dtm_funcs_reset();
#  endif

#  if CONFIG_BT_CTRL_BLE_SCAN
  ble_scan_funcs_reset();
#    if (BT_CTRL_50_FEATURE_SUPPORT == 1)
  ble_ext_scan_funcs_reset();
#    endif
#  endif

#  if (BT_BLE_CCA_MODE != 0)
  ble_cca_funcs_reset();
#  endif

#  if CONFIG_BT_CTRL_BLE_SECURITY_ENABLE
  ble_enc_funcs_reset();
#  endif

#  if CONFIG_BT_CTRL_BLE_MASTER
  ble_init_funcs_reset();
  ble_con_funcs_reset();
#  endif

#endif
}

/****************************************************************************
 * Name: bt_async_wakeup_request
 *
 * Description:
 *   This function requests an asynchronous wakeup for the Bluetooth
 *   controller. It calls the async_wakeup_request function with
 *   BTDM_ASYNC_WAKEUP_SRC_VHCI as the argument.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The result of the async_wakeup_request function.
 *
 ****************************************************************************/

