apache/nuttx/arch/risc-v/src/esp32c2/esp_ble_adapter.c
  err = btdm_controller_init(cfg);

  if (err != OK)
    {
      wlerr("%s %d\n", __func__, err);
      err = -ENOMEM;
      goto error;
    }

#if (CONFIG_BT_BLUEDROID_ENABLED || CONFIG_BT_NIMBLE_ENABLED)
  scan_stack_enable_adv_flow_ctrl_vs_cmd(true);
  adv_stack_enable_clear_legacy_adv_vs_cmd(true);
  adv_filter_stack_enable_dup_exc_list_vs_cmd(true);
  chan_sel_stack_enable_set_csa_vs_cmd(true);
#endif

  g_btdm_controller_status = ESP_BT_CONTROLLER_STATUS_INITED;

#ifdef CONFIG_ESPRESSIF_SPIFLASH
  if (esp_wireless_init() != OK)
    {
      return -EIO;
    }
#endif

  return OK;

error:

  bt_controller_deinit_internal();

  return esp_wifi_to_errno(err);
}

/****************************************************************************
 * Name: esp_bt_controller_deinit
 *
 * Description:
 *   Deinit BT controller.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) is returned on success. Otherwise, -1 (ERROR) is returned.
 *
 ****************************************************************************/

int esp_bt_controller_deinit(void)
{
  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_INITED)
    {
      return ERROR;
    }

#if (CONFIG_BT_BLUEDROID_ENABLED || CONFIG_BT_NIMBLE_ENABLED)
  scan_stack_enable_adv_flow_ctrl_vs_cmd(false);
  adv_stack_enable_clear_legacy_adv_vs_cmd(false);
  adv_filter_stack_enable_dup_exc_list_vs_cmd(false);
  chan_sel_stack_enable_set_csa_vs_cmd(false);
#endif

  btdm_controller_deinit();

  bt_controller_deinit_internal();

  return OK;
}

/****************************************************************************
 * Name: esp_bt_controller_enable
 *
 * Description:
 *   Enable BT controller.
 *
 * Input Parameters:
 *   mode - the mode(BLE/BT/BTDM) to enable. For compatible of API, retain
 *   this argument. This mode must be equal as the mode in "cfg" of
 *   esp_bt_controller_init().
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned
 *   on failure.
 *
 ****************************************************************************/

int esp_bt_controller_enable(esp_bt_mode_t mode)
{
  int ret = OK;

  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_INITED)
    {
      return ERROR;
    }

  if (mode != btdm_controller_get_mode())
    {
      wlerr("invalid mode %d, controller support mode is %d",
            mode, btdm_controller_get_mode());
      return ERROR;
    }

  /* Enable PHY when enabling controller to reduce power dissipation after
   * controller init. Notice the init order: esp_phy_enable() ->
   * bt_bb_v2_init_cmplx() -> coex_pti_v2()
   */

  esp_phy_enable(PHY_MODEM_BT);
  g_lp_stat.phy_enabled = 1;

#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  coex_enable();
#endif

#ifdef CONFIG_PM
  /* enable low power mode */

  if (g_lp_cntl.no_light_sleep)
    {
      esp_pm_lock_acquire(g_light_sleep_pm_lock);
    }

  esp_pm_lock_acquire(g_pm_lock);
  g_lp_stat.pm_lock_released = 0;
#endif

#if CONFIG_MAC_BB_PD
  if (esp_register_mac_bb_pd_callback(btdm_mac_bb_power_down_cb) != 0)
    {
      ret = -EINVAL;
      goto error;
    }

  if (esp_register_mac_bb_pu_callback(btdm_mac_bb_power_up_cb) != 0)
    {
      ret = -EINVAL;
      goto error;
    }
#endif

  if (g_lp_cntl.enable)
    {
      btdm_controller_enable_sleep(true);
    }

  /* Disable pll track by default in BLE controller on ESP32-C2.
   */

  sdk_config_extend_set_pll_track(false);

  if (btdm_controller_enable(mode) != 0)
    {
      ret = ERROR;
      goto error;
    }

  coex_pti_v2();

  g_btdm_controller_status = ESP_BT_CONTROLLER_STATUS_ENABLED;

  return ret;

error:

#if CONFIG_MAC_BB_PD
  esp_unregister_mac_bb_pd_callback(btdm_mac_bb_power_down_cb);
  esp_unregister_mac_bb_pu_callback(btdm_mac_bb_power_up_cb);
#endif

  /* disable low power mode */

  btdm_controller_enable_sleep(false);

#ifdef CONFIG_PM
  if (g_lp_cntl.no_light_sleep)
    {
      esp_pm_lock_release(g_light_sleep_pm_lock);
    }

  if (g_lp_stat.pm_lock_released == 0)
    {
      esp_pm_lock_release(g_pm_lock);
      g_lp_stat.pm_lock_released = 1;
    }
#endif

#if CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  coex_disable();
#endif
  if (g_lp_stat.phy_enabled)
    {
      esp_phy_disable(PHY_MODEM_BT);
      g_lp_stat.phy_enabled = 0;
    }

  return ret;
}

/****************************************************************************
 * Name: esp_bt_controller_disable
 *
 * Description:
 *   Disable BT controller.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned
 *   on failure.
 *
 ****************************************************************************/

int esp_bt_controller_disable(void)
{
  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED)
    {
      return ERROR;
    }

  async_wakeup_request(BTDM_ASYNC_WAKEUP_SRC_DISA);
  while (!btdm_power_state_active())
    {
      nxsched_usleep(1000); /* wait */
    }

  btdm_controller_disable();

  async_wakeup_request_end(BTDM_ASYNC_WAKEUP_SRC_DISA);

#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  coex_disable();
#endif

  if (g_lp_stat.phy_enabled)
    {
      esp_phy_disable(PHY_MODEM_BT);
      g_lp_stat.phy_enabled = 0;
    }

  g_btdm_controller_status = ESP_BT_CONTROLLER_STATUS_INITED;

  /* disable low power mode */

#if CONFIG_MAC_BB_PD
  esp_unregister_mac_bb_pd_callback(btdm_mac_bb_power_down_cb);
  esp_unregister_mac_bb_pu_callback(btdm_mac_bb_power_up_cb);
#endif

#ifdef CONFIG_PM
  if (g_lp_cntl.no_light_sleep)
    {
      esp_pm_lock_release(g_light_sleep_pm_lock);
    }

  if (g_lp_stat.pm_lock_released == 0)
    {
      esp_pm_lock_release(g_pm_lock);
      g_lp_stat.pm_lock_released = 1;
    }
  else
    {
      DEBUGPANIC();
    }
#endif

  return OK;
}

/****************************************************************************
 * Name: esp_bt_controller_get_status
 *
 * Description:
 *   Returns the status of the BT Controller
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The current status (type esp_bt_controller_status_t)
 *
 ****************************************************************************/

esp_bt_controller_status_t esp_bt_controller_get_status(void)
{
  return g_btdm_controller_status;
}

/****************************************************************************
 * Name: esp_vhci_host_check_send_available
 *
 * Description:
 *   Check if the host can send packet to controller or not.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   bool - true or false
 *
 ****************************************************************************/

bool esp_vhci_host_check_send_available(void)
{
  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED)
    {
      return false;
    }

  return api_vhci_host_check_send_available();
}

/****************************************************************************
 * Name: esp_vhci_host_send_packet
 *
 * Description:
 *   Host send packet to controller.
 *
 * Input Parameters:
 *   data - the packet pointer
 *   len  - the packet length
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp_vhci_host_send_packet(uint8_t *data, uint16_t len)
{
  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED)
    {
      return;
    }

  async_wakeup_request(BTDM_ASYNC_WAKEUP_SRC_VHCI);

  api_vhci_host_send_packet(data, len);

  async_wakeup_request_end(BTDM_ASYNC_WAKEUP_SRC_VHCI);
}

/****************************************************************************
 * Name: esp_vhci_register_callback
 *
 * Description:
 *   Register the vhci reference callback.
 *
 * Input Parameters:
 *   callback - struct defined by vhci_host_callback structure.
 *
 * Returned Value:
 *   status - success or fail
 *
 ****************************************************************************/

int esp_vhci_register_callback(const esp_vhci_host_callback_t *callback)
{
  int ret = ERROR;
  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED)
    {
      return ret;
    }

  ret = api_vhci_host_register_callback(
            (const vhci_host_callback_t *)callback) == 0 ? 0 : -1;
  return ret;
}

/****************************************************************************
 * Name: esp_bt_get_lpclk_src
 *
 * Description:
 *   This function returns the source of the low power clock for the ESP
 *   Bluetooth controller. If the controller is not initialized or enabled,
 *   it returns ESP_BT_SLEEP_CLOCK_NONE. Otherwise, it returns the current
 *   low power clock selection.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The source of the low power clock for the ESP Bluetooth controller.
 *
 ****************************************************************************/

esp_bt_sleep_clock_t esp_bt_get_lpclk_src(void)
{
  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_INITED &&
      g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED)
    {
      return ESP_BT_SLEEP_CLOCK_NONE;
    }

  return g_lp_cntl.lpclk_sel;
}
